# Python Data, 2024

---

* [Spojov치n칤 dat](#Spojov%C3%A1n%C3%AD-dat),
    - [spojov치n칤 s CONCAT](#Spojov치n칤-s-CONCAT),
    - [spojov치n칤 s CONCAT a JOIN](#concat-a-voliteln칳-argument-join),
    - [spojov치n칤 s metodou APPEND](#Spojov치n칤-pomoc칤-metody-APPEND),
    - [spojov치n칤 s MERGE](#Spojov치n칤-pomoc칤-merge),
    - [spojov치n칤 s metodou JOIN](#Spojen칤-pomoc칤-index콢,-join),
* [Agregace](#Agregace),
    - [jednoduch치 agregace](#Jednoduch치-agregace),
    - [seskupov치n칤 GROUPBY](#Seskupov치n칤-groupby),
    - [agregace](#Agregace-s-metodami),
    - [filtrov치n칤](#Filtrov치n칤),
    - [transformace](#Transformace),
    - [apply](#Metoda-apply),
* [Pivot tabulka](#Pivot-tabulky),
    - [칰vodn칤 motivace](),
    - [syntaxe tabulky](),
    - [dopl켿uj칤c칤 mo쬹osti]().
---



<img src="https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse1.mm.bing.net%2Fth%3Fid%3DOIP.APOjuHGvkM0wQaUx9ELKAgHaHa%26pid%3DApi&f=1&ipt=a8b2b692c40e190d4b28c164bf13e6c944702a69944035a4ef9053aa6ea1b190&ipo=images" width="160" style="margin-left:auto; margin-right:auto"/>

<br>

## Spojov치n칤 dat

---

Takov칳mi operacemi si m콢쬰코 p콏edstavit jednoduch칠 operace jako **spojov치n칤** (*konkatenace*) **dvou a v칤ce dataset콢** a po slo쬴t캩j코칤 *JOINY* podobn캩 jako u datab치z칤.

`pandas` obsahuje r콢zn칠 *funkce* a *metody*, kter칠 umo쮄갓j칤 tento zp콢sob pr치ce.

* funkce `concat`,
* funkce `merge`,
* metoda `append` (*outdated*),
* metoda `join`.

### Spojov치n칤 s CONCAT

---

Funkce `concat()` v `pandas` umo쮄갓je spojit **dva nebo v칤ce**:
1. **sloupe캜k콢** tabulky,
    - *horizont치ln캩*, po sloupc칤ch,
    - *vertik치ln캩*, po Indexech,
3. **tabulek** samotn칳ch,
    - *horizont치ln캩*, po sloupc칤ch,
    - *vertik치ln캩*, po Indexech,

Pou쬴t칤 funkce `concat()` spo캜칤v치 **v p콏ed치n칤 seznamu objekt콢**, kter칠 chce코 spojit, a parametru `axis`, kter칳 ur캜uje osu, podle kter칠 se m치j칤 objekty spojit:

#### Spojen칤 sloupe캜k콢, CONCAT

---

In [1]:
import pandas as pd

In [2]:
sloupec_1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
sloupec_2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])

In [3]:
sloupec_1

1    A
2    B
3    C
dtype: object

In [4]:
sloupec_2

4    D
5    E
6    F
dtype: object

In [11]:
spojene_sloupce = pd.concat(sloupec_1, sloupec_2, axis=0)  # --> "TypeError"

TypeError: concat() takes 1 positional argument but 2 positional arguments (and 1 keyword-only argument) were given

<br>

Spojen칤 **vertik치ln칤** (pod sebou):

In [7]:
spojene_sloupce_vertikalne = pd.concat((sloupec_1, sloupec_2), axis=0)

In [8]:
pd.concat?

Signature:
pd.concat(
    objs: 'Iterable[Series | DataFrame] | Mapping[HashableT, Series | DataFrame]',
    *,
    axis: 'Axis' = 0,
    join: 'str' = 'outer',
    ignore_index: 'bool' = False,
    keys: 'Iterable[Hashable] | None' = None,
    levels=None,
    names: 'list[HashableT] | None' = None,
    verify_integrity: 'bool' = False,
    sort: 'bool' = False,
    copy: 'bool | None' = None,
) -> 'DataFrame | Series'
Docstring:
Concatenate pandas objects along a particular axis.

Allows optional set logic along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis,
which may be useful if the labels are the same (or overlapping) on
the passed axis number.

Parameters
----------
objs : a sequence or mapping of Series or DataFrame objects
    If a mapping is passed, the sorted keys will be used as the `keys`
    argument, unless it is passed, in which case the values will be
    selected (see below). Any None objects will be dropped silently unless
    they are all None in which case a ValueError will be raised.
axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along.
join : {'inner', 'outer'}, default 'outer'
    How to handle indexes on other axis (or axes).
ignore_index : bool, default False
    If True, do not use the index values along the concatenation axis. The
    resulting axis will be labeled 0, ..., n - 1. This is useful if you are
    concatenating objects where the concatenation axis does not have
    meaningful indexing information. Note the index values on the other
    axes are still respected in the join.
keys : sequence, default None
    If multiple levels passed, should contain tuples. Construct
    hierarchical index using the passed keys as the outermost level.
levels : list of sequences, default None
    Specific levels (unique values) to use for constructing a
    MultiIndex. Otherwise they will be inferred from the keys.
names : list, default None
    Names for the levels in the resulting hierarchical index.
verify_integrity : bool, default False
    Check whether the new concatenated axis contains duplicates. This can
    be very expensive relative to the actual data concatenation.
sort : bool, default False
    Sort non-concatenation axis if it is not already aligned. One exception to
    this is when the non-concatentation axis is a DatetimeIndex and join='outer'
    and the axis is not already aligned. In that case, the non-concatenation
    axis is always sorted lexicographically.
copy : bool, default True
    If False, do not copy data unnecessarily.

Returns
-------
object, type of objs
    When concatenating all ``Series`` along the index (axis=0), a
    ``Series`` is returned. When ``objs`` contains at least one
    ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
    the columns (axis=1), a ``DataFrame`` is returned.

See Also
--------
DataFrame.join : Join DataFrames using indexes.
DataFrame.merge : Merge DataFrames by indexes or columns.

Notes
-----
The keys, levels, and names arguments are all optional.

A walkthrough of how this method fits in with other tools for combining
pandas objects can be found `here
<https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

It is not recommended to build DataFrames by adding single rows in a
for loop. Build a list of rows and make a DataFrame in a single concat.

Examples
--------
Combine two ``Series``.

>>> s1 = pd.Series(['a', 'b'])
>>> s2 = pd.Series(['c', 'd'])
>>> pd.concat([s1, s2])
0    a
1    b
0    c
1    d
dtype: object

Clear the existing index and reset it in the result
by setting the ``ignore_index`` option to ``True``.

>>> pd.concat([s1, s2], ignore_index=True)
0    a
1    b
2    c
3    d
dtype: object

Add a hierarchical index at the outermost level of
the data with the ``keys`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'])
s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

Label the index keys you create with the ``names`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'],
...           names=['Series name', 'Row ID'])
Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

Combine two ``DataFrame`` objects with identical columns.

>>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
...                    columns=['letter', 'number'])
>>> df1
  letter  number
0      a       1
1      b       2
>>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
...                    columns=['letter', 'number'])
>>> df2
  letter  number
0      c       3
1      d       4
>>> pd.concat([df1, df2])
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects with overlapping columns
and return everything. Columns outside the intersection will
be filled with ``NaN`` values.

>>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
...                    columns=['letter', 'number', 'animal'])
>>> df3
  letter  number animal
0      c       3    cat
1      d       4    dog
>>> pd.concat([df1, df3], sort=False)
  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

Combine ``DataFrame`` objects with overlapping columns
and return only those that are shared by passing ``inner`` to
the ``join`` keyword argument.

>>> pd.concat([df1, df3], join="inner")
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects horizontally along the x axis by
passing in ``axis=1``.

>>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
...                    columns=['animal', 'name'])
>>> pd.concat([df1, df4], axis=1)
  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

Prevent the result from including duplicate index values with the
``verify_integrity`` option.

>>> df5 = pd.DataFrame([1], index=['a'])
>>> df5
   0
a  1
>>> df6 = pd.DataFrame([2], index=['a'])
>>> df6
   0
a  2
>>> pd.concat([df5, df6], verify_integrity=True)
Traceback (most recent call last):
    ...
ValueError: Indexes have overlapping values: ['a']

Append a single row to the end of a ``DataFrame`` object.

>>> df7 = pd.DataFrame({'a': 1, 'b': 2}, index=[0])
>>> df7
    a   b
0   1   2
>>> new_row = pd.Series({'a': 3, 'b': 4})
>>> new_row
a    3
b    4
dtype: int64
>>> pd.concat([df7, new_row.to_frame().T], ignore_index=True)
    a   b
0   1   2
1   3   4
File:      ~/.pyenv/versions/3.12.5/lib/python3.12/site-packages/pandas/core/reshape/concat.py
Type:      function

In [12]:
spojene_sloupce_vertikalne

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

<br>

Spojen칤 **horizont치ln칤** (vedle sebe):

In [13]:
horizontalni_spoj = pd.concat([sloupec_1, sloupec_2], axis=1)

In [14]:
horizontalni_spoj

     0    1
1    A  NaN
2    B  NaN
3    C  NaN
4  NaN    D
5  NaN    E
6  NaN    F

In [20]:
sloupec_1 = pd.Series(["Matou코", "Marek", "Luk치코", "Jan"], index=[0, 1, 2, 3])
sloupec_2 = pd.Series([23, 25, 27, 29], index=[0, 1, 2, 3])
horizontalni_spoj = pd.concat([sloupec_1, sloupec_2], axis=1)

In [21]:
horizontalni_spoj

        0   1
0  Matou코  23
1   Marek  25
2   Luk치코  27
3     Jan  29

<br>

#### Spojen칤 tabulek, CONCAT

---

In [22]:
uzivatele_tab_1 = {'jmeno': ['Matou코', 'Marek', 'Luk치코'],
               'vek': [25, 30, 35]}

In [23]:
uzivatele_tab_2 = {'jmeno': ['Petr', 'Jan', 'Michal'],
                   'vek': [40, 45, 50]}

In [24]:
uzivatele_tab_1_df = pd.DataFrame(uzivatele_tab_1)
uzivatele_tab_2_df = pd.DataFrame(uzivatele_tab_2)

In [25]:
uzivatele_tab_1_df

    jmeno  vek
0  Matou코   25
1   Marek   30
2   Luk치코   35

In [26]:
uzivatele_tab_2_df

    jmeno  vek
0    Petr   40
1     Jan   45
2  Michal   50


#### Samotn칠 spojen칤 dvou tabulek

---

Stejn캩 jako u sloupe캜k콢, nezapom칤nat na pozi캜n칤 argumenty (z치vorka).

Stejn캩 tak, vybrat spr치vnou osu.

In [27]:
spojene_tab_df = pd.concat([uzivatele_tab_1_df, uzivatele_tab_2_df], axis=0)

In [28]:
spojene_tab_df

    jmeno  vek
0  Matou코   25
1   Marek   30
2   Luk치코   35
0    Petr   40
1     Jan   45
2  Michal   50

#### Co s duplicitn칤mi Indexy?

---

Tady se ov코em **zduplikovali hodnoty** n캩kter칳ch index콢.

Ty je pot콏eba opravit t칤mto postupem:
1. **Vytvo콏칤m nov칳 sloupe캜ek** pro Indexy,
2. **odstran칤m star칳 sloupe캜ek** s duplicitami.

In [29]:
spojene_tab_df = spojene_tab_df.reset_index()  # P콏id치 nov칳 Index

In [30]:
spojene_tab_df

   index   jmeno  vek
0      0  Matou코   25
1      1   Marek   30
2      2   Luk치코   35
3      0    Petr   40
4      1     Jan   45
5      2  Michal   50

In [31]:
spojene_tab_df = spojene_tab_df.drop("index", axis=1)

In [32]:
spojene_tab_df

    jmeno  vek
0  Matou코   25
1   Marek   30
2   Luk치코   35
3    Petr   40
4     Jan   45
5  Michal   50

<br>

Kontrola nov칠ho rozsahu **pro Index**:

In [33]:
spojene_tab_df.index

RangeIndex(start=0, stop=6, step=1)

<br>

Poz콢statky sloupe캜k콢:

In [34]:
spojene_tab_df.columns

Index(['jmeno', 'vek'], dtype='object')

<br>

Nastaven칤 nov칳ch Index콢 **podle jmen**:

In [29]:
# spojene_tab_df.index.names?

<br>

Dopln칤코 jm칠no **pro Index**:

In [30]:
spojene_tab_df.index.names = ["Index ze jm칠n"]

In [31]:
spojene_tab_df.index.names

FrozenList(['Index ze jm칠n'])

In [32]:
spojene_tab_df.index

RangeIndex(start=0, stop=6, step=1, name='Index ze jm칠n')

In [33]:
spojene_tab_df

                jmeno  vek
Index ze jm칠n
0              Matou코   25
1               Marek   30
2               Luk치코   35
3                Petr   40
4                 Jan   45
5              Michal   50

Pro odchyt치v치n칤 **duplicitn칤ch index콢** m콢쬰코 doplnit parametr `verify_integrity=True`, p콏칤padn캩 pokud je irelevantn칤, ignorovat jej 칰pln캩 `ignore_index=True`.

<br>

**游 CVI캛EN칈 游, procvi캜 si funkc칤 CONCAT**

In [35]:
data_populace: dict[str, list] = {
    "City": ["New York", "London", "Tokyo"],
    "Population": [8.4, 9.0, 13.9],
}

data_plocha = {
    "City": ["New York", "London", "Tokyo"],
    "Area": [783, 1572, 2194],
}

data_kontinent = {
    "City": ["New York", "London", "Tokyo"],
    "Continent": ["North America", "Europe", "Asia"],
}

# Vytvo콏 funkci "spoj_data_mest", kter치 spoj칤 3 p콏edchoz칤 DF

<details>
    <summary>郊윒잺 콎e코en칤</summary>
    
```python
from pandas import DataFrame, concat

data_populace = {
    "City": ["New York", "London", "Tokyo"],
    "Population": [8.4, 9.0, 13.9],
}

data_plocha = {
    "City": ["New York", "London", "Tokyo"],
    "Area": [783, 1572, 2194],
}

data_kontinent = {
    "City": ["New York", "London", "Tokyo"],
    "Continent": ["North America", "Europe", "Asia"],
}

populace_df = DataFrame(data_populace)
plocha_df = DataFrame(data_plocha)
kontinent_df = DataFrame(data_kontinent)


def spoj_data_mest(populace, plocha, kontinent):
    """
    Spoj칤 t콏i tabulky horizont치ln캩 podle sloupce City.
    """
    return concat([populace.set_index("City"),
                      plocha.set_index("City"),
                      kontinent.set_index("City")], axis=1).reset_index()


result = spoj_data_mest(populace_df, plocha_df, kontinent_df)
print(result)
```
</details>

<img src="https://imgs.search.brave.com/wR9sz6BPwR_LCDm6Esd_B9VgUBSbW4wbTPi2T9DrdBc/rs:fit:500:0:0:0/g:ce/aHR0cHM6Ly90NC5m/dGNkbi5uZXQvanBn/LzA4LzQwLzM1LzIx/LzM2MF9GXzg0MDM1/MjE1Ml84N1N2T0kx/REM2RElCaHkxc0xz/VnpnYmNIUk1UZno0/cC5qcGc" width="230" style="margin-left:auto; margin-right:auto"/>

### CONCAT a voliteln칳 argument JOIN

---

V jednoduch칳ch uk치zk치ch, jako jsou ty v칳코e, sta캜ilo **tabulky a sloupe캜ky spojit**.

To prakticky nen칤 v쬯y ide치ln칤 콏e코en칤, proto쬰 n캩kter칠 sloupe캜ky m콢쬺u, **ale nemus칤 b칳t shodn칠**.

In [36]:
data_tab_1_df = pd.DataFrame(
    {"A": ["A1", "A2"], "B": ["B1", "B2"], "C": ["C1", "C2"]},
    index=[1, 2]
)

In [37]:
data_tab_2_df = pd.DataFrame(
    {"B": ["B3", "B4"], "C": ["C3", "C4"], "D": ["D3", "D4"]},
    index=[3, 4]
)

In [38]:
data_tab_1_df

    A   B   C
1  A1  B1  C1
2  A2  B2  C2

In [39]:
data_tab_2_df

    B   C   D
3  B3  C3  D3
4  B4  C4  D4


#### Horizont치ln칤 spojen칤 dvou tabulek

---

In [40]:
vystup_tab_df = pd.concat([data_tab_1_df, data_tab_2_df])  # axis=0

In [41]:
vystup_tab_df

     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

Pokud n캩kter치 data chyb캩j칤, jsou automaticky vypln캩n치 **nezn치m칳mi hodnotami**.

콎e코en칤m takov칠 situace m콢쬰코 b칳t zaveden칤 jin칠ho **zp콢sobu spojov치n칤**.

Tedy nepou쮂셨at defaultn칤 argument `join='outer'`, ale `join='inner'`:

In [42]:
vystup_bez_nan_df = pd.concat([data_tab_1_df, data_tab_2_df],
                           join='inner',
                           axis=0)

In [43]:
vystup_bez_nan_df

    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

In [45]:
vystup_vc_nan_df = pd.concat([data_tab_1_df, data_tab_2_df],
                           join='outer',
                           axis=0)

In [46]:
vystup_vc_nan_df

     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

<img src="https://imgs.search.brave.com/IZ8jkD1GaDV2tXwgwzM1Xawk-jBMejygby1KcermQp8/rs:fit:500:0:0:0/g:ce/aHR0cHM6Ly90NC5m/dGNkbi5uZXQvanBn/LzA4LzQ2LzQ3LzE1/LzM2MF9GXzg0NjQ3/MTU2MF95Y281RnhM/UG5RR1c4NW1OWHBD/UmcxUWptSzRiMnp3/eS5qcGc" width="200" style="margin-left:auto; margin-right:auto"/>

### Spojov치n칤 pomoc칤 `MERGE`

---

Dal코칤 funkc칤 pro spojov치n칤 `DataFrame` objekt콢 je `merge`.

Tato funkce je vhodn치 pro spojov치n칤 DataFrame objekt콢, kter칠 **maj칤 spole캜n칠 sloupce**.

M콢쬰코 l칠pe zad치vat typ spojen칤 (parametr `how='inner' | 'outer' | 'left' | 'join'`).

D치le ti umo쬹칤 **definovat sloupec, nebo sloupce**, na kter칳ch chce코 spojen칤 prov칠st (parametr `on`).

In [47]:
uzivatele_tab_1 = {
    'jmeno': ['Alice', 'Bob', 'Charlie', 'David'],
    'vek': [25, 30, 35, 40],
    'mesto': ['Brno', 'Praha', 'Plzen', 'Ostrava']
}

In [48]:
uzivatele_tab_2 = {
    'jmeno': ['Alice', 'David', 'Emma', 'Frank'],
    'pocet_prijemcu': [100, 200, 150, 250]
}

In [49]:
uzivatele_tab_1_df = pd.DataFrame(uzivatele_tab_1)
uzivatele_tab_2_df = pd.DataFrame(uzivatele_tab_2)

In [50]:
uzivatele_tab_1_df

     jmeno  vek    mesto
0    Alice   25     Brno
1      Bob   30    Praha
2  Charlie   35    Plzen
3    David   40  Ostrava

In [51]:
uzivatele_tab_2_df

   jmeno  pocet_prijemcu
0  Alice             100
1  David             200
2   Emma             150
3  Frank             250

#### Spojen칤 FULL JOIN

---

In [52]:
mergnute_df = pd.merge(uzivatele_tab_1_df,
                       uzivatele_tab_2_df,
                       on='jmeno',
                       how='outer')

In [53]:
mergnute_df

     jmeno   vek    mesto  pocet_prijemcu
0    Alice  25.0     Brno           100.0
1      Bob  30.0    Praha             NaN
2  Charlie  35.0    Plzen             NaN
3    David  40.0  Ostrava           200.0
4     Emma   NaN      NaN           150.0
5    Frank   NaN      NaN           250.0

#### Spojen칠 INNER MERGE

---

In [54]:
mergnute_inner_df = pd.merge(uzivatele_tab_1_df,
                             uzivatele_tab_2_df,
                             on='jmeno',
                             how='inner')

In [55]:
mergnute_inner_df

   jmeno  vek    mesto  pocet_prijemcu
0  Alice   25     Brno             100
1  David   40  Ostrava             200

Funkce sama **dopln칤 p콏칤pony**, aby rozli코ila **mezi ob캩ma p콢vodn칤mi sloupci**.

**Pokud pot콏ebuje코 vlastn칤 p콏칤pony**, m콢쬰코 vyzkou코et voliteln칳 argument pro `suffixes`:

In [56]:
df8 = pd.DataFrame({
    'jmeno': ['Bob', 'Jake', 'Lisa', 'Sue'],
    'poradi': [1, 2, 3, 4]
})

In [57]:
df9 = pd.DataFrame({
    'jmeno': ['Bob', 'Jake', 'Lisa', 'Sue'],
    'poradi': [3, 1, 4, 2]
})

In [58]:
df8

  jmeno  poradi
0   Bob       1
1  Jake       2
2  Lisa       3
3   Sue       4

In [59]:
df9

  jmeno  poradi
0   Bob       3
1  Jake       1
2  Lisa       4
3   Sue       2

In [60]:
vystup_konflikt = pd.merge(df8, df9, on="jmeno")

In [61]:
vystup_konflikt

  jmeno  poradi_x  poradi_y
0   Bob         1         3
1  Jake         2         1
2  Lisa         3         4
3   Sue         4         2

In [68]:
vystup_vlastni_pripony = pd.merge(df8, df9, on='jmeno', suffixes=('_DF8', '_DF9'))

In [63]:
vystup_vlastni_pripony

  jmeno  poradi_DF8  poradi_DF9
0   Bob           1           3
1  Jake           2           1
2  Lisa           3           4
3   Sue           4           2

Obecn캩 plat칤, 쬰 pokud pot콏ebuje코 *spojit* dva nebo v칤ce `DataFrame` objekt콢 podle **spole캜n칠ho sloupce nebo sloupc콢**, pou쬴j funkci `merge()`.

Pokud chce코 jenom **p콏idat dal코칤 콏치dky nebo sloupce** do existuj칤c칤ho `DataFrame` objektu, pou쬴j funkci `concat`.

#### Uk치zka MERGE funkce s dopomoc칤 `LEFT/RIGHT`

In [64]:
uzivatele_tab_1_df

     jmeno  vek    mesto
0    Alice   25     Brno
1      Bob   30    Praha
2  Charlie   35    Plzen
3    David   40  Ostrava

In [65]:
uzivatele_tab_2_df

   jmeno  pocet_prijemcu
0  Alice             100
1  David             200
2   Emma             150
3  Frank             250

In [70]:
vystup_left_join_df = pd.merge(uzivatele_tab_1_df,
                               uzivatele_tab_2_df,
                               on='jmeno',
                               how='left')

In [71]:
vystup_left_join_df

     jmeno  vek    mesto  pocet_prijemcu
0    Alice   25     Brno           100.0
1      Bob   30    Praha             NaN
2  Charlie   35    Plzen             NaN
3    David   40  Ostrava           200.0

V uk치zce v칳코 je pou쬴t칳 *left join*.

Tedy ve v칳sledku uvid칤코 **celou prvn칤** (levou tabulku) a z druh칠 pouze ty z치znamy, kter칠 maj칤 ve spojovac칤m sloupci `jmeno` spole캜nou hodnotu.

D치 se naps치t i *right join*.

In [74]:
vystup_right_join_obr_df = pd.merge(uzivatele_tab_2_df,
                                    uzivatele_tab_1_df,
                                    on='jmeno',
                                    how='right')

In [76]:
vystup_right_join_obr_df

     jmeno  pocet_prijemcu  vek    mesto
0    Alice           100.0   25     Brno
1      Bob             NaN   30    Praha
2  Charlie             NaN   35    Plzen
3    David           200.0   40  Ostrava

#### Uk치zka MERGE funkce s dopomoc칤 `CROSS`

In [77]:
jmena_df = pd.DataFrame({"jmeno": ["Matou코", "Marek", "Luk치코"]})
mesta_df = pd.DataFrame({"mesto": ["Praha", "Brno"]})

In [78]:
jmena_df

    jmeno
0  Matou코
1   Marek
2   Luk치코

In [79]:
mesta_df

   mesto
0  Praha
1   Brno

In [81]:
kombinace_df = jmena_df.merge(mesta_df, how="cross")
kombinace_df

    jmeno  mesto
0  Matou코  Praha
1  Matou코   Brno
2   Marek  Praha
3   Marek   Brno
4   Luk치코  Praha
5   Luk치코   Brno

In [82]:
jmena_df = pd.DataFrame({
    "jmeno": ["Matou코", "Marek", "Luk치코"],
    "vek": [23, 25, 27]
})

mesta_df = pd.DataFrame({
    "mesto": ["Praha", "Brno"],
    "zeme": ["캛esko", "캛esko"]
})

In [83]:
jmena_df

    jmeno  vek
0  Matou코   23
1   Marek   25
2   Luk치코   27

In [85]:
mesta_df

   mesto   zeme
0  Praha  캛esko
1   Brno  캛esko

In [86]:
kombinace_df = jmena_df.merge(mesta_df, how="cross")
kombinace_df

    jmeno  vek  mesto   zeme
0  Matou코   23  Praha  캛esko
1  Matou코   23   Brno  캛esko
2   Marek   25  Praha  캛esko
3   Marek   25   Brno  캛esko
4   Luk치코   27  Praha  캛esko
5   Luk치코   27   Brno  캛esko

### Spojen칤 pomoc칤 index콢, `JOIN`

---

Tato metoda slou쮂 k propojen칤 dvou DataFrame objekt콢 na z치klad캩 **jejich index콢 nebo hodnot**.

Je velice podobn치 funkci `merge` ale je p콏칤mo sou캜치st칤 `DataFrame` objektu a je snaz코칤 ji aplikovat:

In [87]:
uzivatele_1 = {
    'jmeno': ['Alice', 'Bob', 'Petr'],
     'vek': [25, 30, 35]
}

In [88]:
uzivatele_2 = {
    'jmeno': ['Alice', 'Bob', 'Petr'],
    'pocet_prijemcu': [100, 150, 200]
}

In [89]:
df_uzivatele_1 = pd.DataFrame(uzivatele_1)
df_uzivatele_2 = pd.DataFrame(uzivatele_2)

In [90]:
df_uzivatele_1

   jmeno  vek
0  Alice   25
1    Bob   30
2   Petr   35

In [91]:
df_uzivatele_2

   jmeno  pocet_prijemcu
0  Alice             100
1    Bob             150
2   Petr             200

In [94]:
df_uzivatele_1.index

RangeIndex(start=0, stop=3, step=1)

In [95]:
df_uzivatele_2.index

RangeIndex(start=0, stop=3, step=1)

In [96]:
uzivatele_1_df = df_uzivatele_1.set_index('jmeno')

In [97]:
uzivatele_2_df = df_uzivatele_2.set_index('jmeno')

In [98]:
uzivatele_1_df

       vek
jmeno
Alice   25
Bob     30
Petr    35

In [99]:
uzivatele_2_df

       pocet_prijemcu
jmeno
Alice             100
Bob               150
Petr              200

In [100]:
uzivatele_1_df.index

Index(['Alice', 'Bob', 'Petr'], dtype='object', name='jmeno')

In [101]:
uzivatele_2_df.index

Index(['Alice', 'Bob', 'Petr'], dtype='object', name='jmeno')

In [102]:
vysledek_join_metody = uzivatele_1_df.join(uzivatele_2_df)

In [103]:
vysledek_join_metody

       vek  pocet_prijemcu
jmeno
Alice   25             100
Bob     30             150
Petr    35             200

Hlavn칤 rozd칤l mezi t캩mito funkcemi je zp콢sob ur캜en칤 **sloupce nebo sloupc콢**, podle kter칳ch se m치 propojen칤 prov칠st.

1. Metoda `join()` propojuje DataFrame objekty **na z치klad캩 jejich Index콢**.
2. Funkce `merge()` umo쮄갓je propojit `DataFrame` objekty **na z치klad캩 hodnoty v jednom nebo v칤ce sloupc칤ch**.

### Souhrn ke spojov치n칤

---

| Objekt | Kdy jej pou쮂셦? | Sm캩r spojen칤 |
| :- | :- | :- |
| `concat` | Kdy chce코 poskl치dat tabulky na sebe (콏치dky) nebo vedle sebe (sloupce). | Vertik치ln캩 / Horizont치ln캩 | 
| `merge` |	Kdy chcete spojit tabulky podle spole캜n칠ho kl칤캜e/sloupce, podobn캩 jako SQL JOIN. | Horizont치ln캩 |
| `join` | Kdy chcete spojit tabulky podle spole캜n칠ho Indexu (ne kl칤캜e/sloupce). | Horizont치ln캩 |
| `append` | (Zastaral칠) Pou쮂셨alo se k p콏id치n칤 콏치dk콢, nyn칤 pou쮂셨ejte concat. | Vertik치ln캩 |

<br>

**游 CVI캛EN칈 游, procvi캜 si spojov치n칤**

Tv칳m 칰kolem je propojit tyto tabulky podle zad치n칤:
1. Pou쬴j spojovac칤 funkci pro spojen칤 objekt콢 typu `DataFrame` , kter칠 vytvo콏칤코 z prom캩nn칳ch `data_zamestnanci_1` a `data_zamestnanci_2`,
2. pou쬴j spojovac칤 funkci, kter칠 zad치코 vznikl칳 objekt typu `DataFrame`  z bodu 1. a druh칳 `DataFrame`, kter칳 vytvo콏칤코 z prom캩nn칠 `data_oddeleni` (spoj p콏es sloupe캜ek `"odd캩len칤_id"`),
3. vytvo콏 v칳sledn칳 objekt typu `DataFrame` , kter칳 obsahuje pouze zam캩stnance z odd캩len칤 `IT`.

In [118]:
data_zamestnanci_1 = {
    'id': [1, 2, 3],
    'jm칠no': ['Jan', 'Marie', 'Petr'],
    'p콏칤jmen칤': ['Nov치k', 'Svobodov치', 'Dvo콏치k'],
    'odd캩len칤_id': [100, 200, 100]
}

data_zamestnanci_2 = {
    'id': [4, 5],
    'jm칠no': ['Anna', 'Josef'],
    'p콏칤jmen칤': ['Kopeck치', 'Vondr치캜ek'],
    'odd캩len칤_id': [200, 100]
}

data_oddeleni = {
    'odd캩len칤_id': [100, 200],
    'n치zev_odd캩len칤': ['IT', 'HR']
}

<details>
    <summary>郊윒잺 콎e코en칤</summary>
    
```python
df_zamestnanci_1 = pd.DataFrame(data_zamestnanci_1)
df_zamestnanci_2 = pd.DataFrame(data_zamestnanci_2)
df_oddeleni = pd.DataFrame(data_oddeleni)

df_vsichni_zamestnanci = pd.concat([df_zamestnanci_1, df_zamestnanci_2], ignore_index=True)

# df1 = pd.concat(
#     [pd.DataFrame(data) for data in [data_zamestnanci_1, data_zamestnanci_2]]
# ).reset_index(drop = True).set_index('id')

df_vsechna_oddeleni = pd.merge(df_vsichni_zamestnanci, df_oddeleni, on="odd캩len칤_id")

df_jen_it = df_vsechna_oddeleni[df_vsechna_oddeleni["n치zev_odd캩len칤"] == "IT"]
```
</details>

## Agregace

---


<img src="https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse1.mm.bing.net%2Fth%3Fid%3DOIP.HtBtNx6dodlNptXV1QGHWQHaG0%26pid%3DApi&f=1&ipt=3a4d1dfa14a495127b4ece5cf689f00ed0c9e0836853358412e18161ae7c505f&ipo=images" width="160" style="margin-left:auto; margin-right:auto"/>


*Seskupov치n칤* neboli **agregace** jsou procesy, kter칠 pat콏칤 k z치kladn칤 efektivn칤 anal칳ze dat.

### Jednoduch치 agregace

---

P콏esto, 쬰 ve코ker칠 z치kladn칤 **statistick칠 칰daje** prakticky nab칤z칤 metoda `describe()`, m콢쬰코 ocenit, kdy stejnou statistiku m콢쬰코 aplikovat **na tebou vybran칠 objekty**.

Mezi nejjednodu코코칤 postupy, jak data analyzovat pat콏칤 metody jako:
* `sum()`,
* `mean()`,
* `median()`,
* `min()`,
* `max()`.

V코echny tyto metody umo쬹칤 z칤skat jedno samotn칠 캜칤slo, kter칠 ti umo쬹칤 prohl칠dnout podstatu zadan칠ho datasetu.

In [104]:
nemovitosti_df = pd.read_csv("../onsite/housing.csv")

In [105]:
nemovitosti_df.head()

,id,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,condition,grade
0,1,221900.0,3,1.00,1180,5650,1,3,7
1,2,538000.0,3,2.25,2570,7242,2,3,7
2,3,180000.0,2,1.00,770,10000,1,3,6
3,4,604000.0,4,3.00,1960,5000,1,5,7
4,5,510000.0,3,2.00,1680,8080,1,3,8

In [106]:
nemovitosti_df.describe()

,id,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,condition,grade
count,10.00000,1.000000e+01,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000
mean,5.50000,4.380750e+05,3.100000,2.100000,2002.500000,16846.200000,1.300000,3.200000,7.400000
std,3.02765,3.137603e+05,0.567646,1.094177,1305.367658,29937.105556,0.483046,0.632456,1.349897
min,1.00000,1.800000e+05,2.000000,1.000000,770.000000,5000.000000,1.000000,3.000000,6.000000
25%,3.25000,2.365000e+05,3.000000,1.125000,1305.000000,6624.750000,1.000000,3.000000,7.000000
50%,5.50000,3.074250e+05,3.000000,2.125000,1747.500000,7356.000000,1.000000,3.000000,7.000000
75%,7.75000,5.310000e+05,3.000000,2.437500,1942.500000,9303.250000,1.750000,3.000000,7.000000
max,10.00000,1.225000e+06,4.000000,4.500000,5420.000000,101930.000000,2.000000,5.000000,11.000000

In [107]:
nemovitosti_df.loc[:, "price"].max()

np.float64(1225000.0)

<br>

캛asto ale nen칤 dosta캜uj칤c칤, prozkoumat data pouze jednoduch칳ch agrega캜n칤ch funkc칤.

Dal코칤 operace, kter칠 je pot콏eba pochopit jsou seskupov치n칤 dat podle zadan칳ch parametr콢.

### Seskupov치n칤 GROUPBY

---

Metoda `groupby`, p콢vodn캩 operace z SQL jazyka, je v r치mci knihovny `pandas` v코estran칳 pomocn칤k pro seskupov치n칤 dat na z치klad캩 r콢zn칳ch krit칠ri칤.

In [119]:
pokus_s_cisly_df = pd.DataFrame(
    {'kl칤캜': ['A', 'B', 'C', 'A', 'B', 'C'],
     '캜칤seln치 hodnota': range(6)},
)

In [120]:
pokus_s_cisly_df

  kl칤캜  캜칤seln치 hodnota
0    A                0
1    B                1
2    C                2
3    A                3
4    B                4
5    C                5

#### Klasick칠 seskupen칤 podle sloupe캜ku

---

In [121]:
pokus_s_cisly_df.groupby?

Signature:
pokus_s_cisly_df.groupby(
    by=None,
    axis: 'Axis | lib.NoDefault' = <no_default>,
    level: 'IndexLabel | None' = None,
    as_index: 'bool' = True,
    sort: 'bool' = True,
    group_keys: 'bool' = True,
    observed: 'bool | lib.NoDefault' = <no_default>,
    dropna: 'bool' = True,
) -> 'DataFrameGroupBy'
Docstring:
Group DataFrame using a mapper or by a Series of columns.

A groupby operation involves some combination of splitting the
object, applying a function, and combining the results. This can be
used to group large amounts of data and compute operations on these
groups.

Parameters
----------
by : mapping, function, label, pd.Grouper or list of such
    Used to determine the groups for the groupby.
    If ``by`` is a function, it's called on each value of the object's
    index. If a dict or Series is passed, the Series or dict VALUES
    will be used to determine the groups (the Series' values are first
    aligned; see ``.align()`` method). If a list or ndarray of length
    equal to the selected axis is passed (see the `groupby user guide
    <https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html#splitting-an-object-into-groups>`_),
    the values are used as-is to determine the groups. A label or list
    of labels may be passed to group by the columns in ``self``.
    Notice that a tuple is interpreted as a (single) key.
axis : {0 or 'index', 1 or 'columns'}, default 0
    Split along rows (0) or columns (1). For `Series` this parameter
    is unused and defaults to 0.

    .. deprecated:: 2.1.0

        Will be removed and behave like axis=0 in a future version.
        For ``axis=1``, do ``frame.T.groupby(...)`` instead.

level : int, level name, or sequence of such, default None
    If the axis is a MultiIndex (hierarchical), group by a particular
    level or levels. Do not specify both ``by`` and ``level``.
as_index : bool, default True
    Return object with group labels as the
    index. Only relevant for DataFrame input. as_index=False is
    effectively "SQL-style" grouped output. This argument has no effect
    on filtrations (see the `filtrations in the user guide
    <https://pandas.pydata.org/docs/dev/user_guide/groupby.html#filtration>`_),
    such as ``head()``, ``tail()``, ``nth()`` and in transformations
    (see the `transformations in the user guide
    <https://pandas.pydata.org/docs/dev/user_guide/groupby.html#transformation>`_).
sort : bool, default True
    Sort group keys. Get better performance by turning this off.
    Note this does not influence the order of observations within each
    group. Groupby preserves the order of rows within each group. If False,
    the groups will appear in the same order as they did in the original DataFrame.
    This argument has no effect on filtrations (see the `filtrations in the user guide
    <https://pandas.pydata.org/docs/dev/user_guide/groupby.html#filtration>`_),
    such as ``head()``, ``tail()``, ``nth()`` and in transformations
    (see the `transformations in the user guide
    <https://pandas.pydata.org/docs/dev/user_guide/groupby.html#transformation>`_).

    .. versionchanged:: 2.0.0

        Specifying ``sort=False`` with an ordered categorical grouper will no
        longer sort the values.

group_keys : bool, default True
    When calling apply and the ``by`` argument produces a like-indexed
    (i.e. :ref:`a transform <groupby.transform>`) result, add group keys to
    index to identify pieces. By default group keys are not included
    when the result's index (and column) labels match the inputs, and
    are included otherwise.

    .. versionchanged:: 1.5.0

       Warns that ``group_keys`` will no longer be ignored when the
       result from ``apply`` is a like-indexed Series or DataFrame.
       Specify ``group_keys`` explicitly to include the group keys or
       not.

    .. versionchanged:: 2.0.0

       ``group_keys`` now defaults to ``True``.

observed : bool, default False
    This only applies if any of the groupers are Categoricals.
    If True: only show observed values for categorical groupers.
    If False: show all values for categorical groupers.

    .. deprecated:: 2.1.0

        The default value will change to True in a future version of pandas.

dropna : bool, default True
    If True, and if group keys contain NA values, NA values together
    with row/column will be dropped.
    If False, NA values will also be treated as the key in groups.

Returns
-------
pandas.api.typing.DataFrameGroupBy
    Returns a groupby object that contains information about the groups.

See Also
--------
resample : Convenience method for frequency conversion and resampling
    of time series.

Notes
-----
See the `user guide
<https://pandas.pydata.org/pandas-docs/stable/groupby.html>`__ for more
detailed usage and examples, including splitting an object into groups,
iterating through groups, selecting a group, aggregation, and more.

Examples
--------
>>> df = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
...                               'Parrot', 'Parrot'],
...                    'Max Speed': [380., 370., 24., 26.]})
>>> df
   Animal  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0
>>> df.groupby(['Animal']).mean()
        Max Speed
Animal
Falcon      375.0
Parrot       25.0

**Hierarchical Indexes**

We can groupby different levels of a hierarchical index
using the `level` parameter:

>>> arrays = [['Falcon', 'Falcon', 'Parrot', 'Parrot'],
...           ['Captive', 'Wild', 'Captive', 'Wild']]
>>> index = pd.MultiIndex.from_arrays(arrays, names=('Animal', 'Type'))
>>> df = pd.DataFrame({'Max Speed': [390., 350., 30., 20.]},
...                   index=index)
>>> df
                Max Speed
Animal Type
Falcon Captive      390.0
       Wild         350.0
Parrot Captive       30.0
       Wild          20.0
>>> df.groupby(level=0).mean()
        Max Speed
Animal
Falcon      370.0
Parrot       25.0
>>> df.groupby(level="Type").mean()
         Max Speed
Type
Captive      210.0
Wild         185.0

We can also choose to include NA in group keys or not by setting
`dropna` parameter, the default setting is `True`.

>>> l = [[1, 2, 3], [1, None, 4], [2, 1, 3], [1, 2, 2]]
>>> df = pd.DataFrame(l, columns=["a", "b", "c"])

>>> df.groupby(by=["b"]).sum()
    a   c
b
1.0 2   3
2.0 2   5

>>> df.groupby(by=["b"], dropna=False).sum()
    a   c
b
1.0 2   3
2.0 2   5
NaN 1   4

>>> l = [["a", 12, 12], [None, 12.3, 33.], ["b", 12.3, 123], ["a", 1, 1]]
>>> df = pd.DataFrame(l, columns=["a", "b", "c"])

>>> df.groupby(by="a").sum()
    b     c
a
a   13.0   13.0
b   12.3  123.0

>>> df.groupby(by="a", dropna=False).sum()
    b     c
a
a   13.0   13.0
b   12.3  123.0
NaN 12.3   33.0

When using ``.apply()``, use ``group_keys`` to include or exclude the
group keys. The ``group_keys`` argument defaults to ``True`` (include).

>>> df = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
...                               'Parrot', 'Parrot'],
...                    'Max Speed': [380., 370., 24., 26.]})
>>> df.groupby("Animal", group_keys=True)[['Max Speed']].apply(lambda x: x)
          Max Speed
Animal
Falcon 0      380.0
       1      370.0
Parrot 2       24.0
       3       26.0

>>> df.groupby("Animal", group_keys=False)[['Max Speed']].apply(lambda x: x)
   Max Speed
0      380.0
1      370.0
2       24.0
3       26.0
File:      ~/.pyenv/versions/3.12.5/lib/python3.12/site-packages/pandas/core/frame.py
Type:      method

In [122]:
pokus_s_cisly_df.groupby("kl칤캜")

Jde op캩t o tzv. *lazy evaluation* proces, samotn칳 nic neprovede, pouze 캜ek치 na pokyn u쬴vatele, kter칳 samotnou agregaci spust칤.

In [123]:
type(pokus_s_cisly_df.groupby("kl칤캜"))

pandas.core.groupby.generic.DataFrameGroupBy

Metoda standardn캩 vrac칤 `DataFrameGroupBy`.

<br>

In [124]:
pokus_s_cisly_df.groupby("kl칤캜").sum()

      캜칤seln치 hodnota
kl칤캜
A                   3
B                   5
C                   7

Metoda `sum()` je pouze jednou z mo쬹ost칤, se kterou m콢쬰코 pracovat.

<br>

#### Sloupe캜kov칠 ozna캜ov치n칤

---

Stejn캩 jako `DataFrame` m콢쬰코 ozna캜ovat tak칠 *GroupBy* objekty.

In [125]:
pokus_s_cisly_df

  kl칤캜  캜칤seln치 hodnota
0    A                0
1    B                1
2    C                2
3    A                3
4    B                4
5    C                5

In [126]:
pokus_s_cisly_df.groupby("kl칤캜")

In [127]:
pokus_s_cisly_df.groupby("kl칤캜")["캜칤seln치 hodnota"]

In [128]:
pokus_s_cisly_df.groupby("kl칤캜")["캜칤seln치 hodnota"].sum()

kl칤캜
A    3
B    5
C    7
Name: 캜칤seln치 hodnota, dtype: int64

<br>

V uplynul칠 uk치zce je zadan치 seskupov치n칤 podle sloupe캜ku `kl칤캜`.

D치le je vybran칳 pouze konkr칠tn칤 sloupe캜ek, na kter칳 chce코 spustit metodu `sum`.

<br>

Pokud pot콏ebuje코 nad vybran칳m objektem prov치d캩t n캩kter칠 procesy ru캜n캩, m콢쬰코 p콏es *GroupBy* objekt **iterovat**:

In [129]:
for (klic, hodnota) in pokus_s_cisly_df.groupby("kl칤캜"):
    print(f"Klic: {klic}; Hodnota={hodnota}")

Klic: A; Hodnota=  kl칤캜  캜칤seln치 hodnota
0    A                0
3    A                3
Klic: B; Hodnota=  kl칤캜  캜칤seln치 hodnota
1    B                1
4    B                4
Klic: C; Hodnota=  kl칤캜  캜칤seln치 hodnota
2    C                2
5    C                5

<br>

### Agregace s metodami

---

Krom캩 jednoduch칳ch agregac칤, nab칤z칤 *GroupBy* 콏adu dal코칤 funkcionality.

Jde o metody:
* `aggregate`,
* `filter`,
* `transform`,
* `apply`.

#### Metoda AGGREGATE

---

In [130]:
import numpy as np

In [131]:
pokus_s_cisly_df = pd.DataFrame(
    {'kl칤캜': ['A', 'B', 'C', 'A', 'B', 'C', 'C'],
     'data_1': range(7),
     'data_2': np.random.randint(0, 10, 7)}
)

In [132]:
pokus_s_cisly_df

  kl칤캜  data_1  data_2
0    A       0       1
1    B       1       4
2    C       2       0
3    A       3       3
4    B       4       4
5    C       5       9
6    C       6       2

Statistick칠 metody ur캜it캩 nab칤z칤 spousty pom콢cek.

Objekt typu *GroupBy* um칤 pracovat tak칠 s funkcemi, stringy a cel칳mi listy.

In [133]:
pokus_s_cisly_df.groupby("kl칤캜").aggregate("sum")

      data_1  data_2
kl칤캜
A          3       4
B          5       8
C         13      11

In [137]:
pokus_s_cisly_df.groupby("kl칤캜").aggregate("median")

      data_1  data_2
kl칤캜
A        1.5     2.0
B        2.5     4.0
C        5.0     2.0

In [138]:
pokus_s_cisly_df.groupby("kl칤캜").aggregate(["min", max])

/tmp/ipykernel_68285/2220003147.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  pokus_s_cisly_df.groupby("kl칤캜").aggregate(["min", max])

     data_1     data_2
        min max    min max
kl칤캜
A         0   3      1   3
B         1   4      4   4
C         2   6      0   9

In [139]:
pokus_s_cisly_df

  kl칤캜  data_1  data_2
0    A       0       1
1    B       1       4
2    C       2       0
3    A       3       3
4    B       4       4
5    C       5       9
6    C       6       2

M콢쬰코 콏칤ct, 쬰 metoda `aggregate` se pou쮂셨치 k aplikaci **jedn칠 nebo v칤ce agrega캜n칤ch funkc칤 na seskupen치 data**.

```
pobocka,ovoce,prodane_mnozstvi,cena
A,apple,10,20
A,banana,15,12
B,apple,8,22
B,banana,30,10
C,apple,20,18
C,banana,25,15
```

| pobocka | ovoce | prodane_mnozstvi | cena |
| :- | :- | :- | :- |
| A | apple | 10 | 20 |

In [140]:
ovoce_data = {
    'pobocka': ['A', 'A', 'B', 'B', 'C', 'C'],
    'ovoce': ['jablko', 'banan', 'jablko', 'banan', 'jablko', 'banan'],
    'prodane_mnozstvi': [10, 15, 8, 30, 20, 25],
    'cena': [20, 12, 22, 10, 18, 15]
}

In [141]:
ovoce_df = pd.DataFrame(ovoce_data)

In [142]:
ovoce_df

  pobocka   ovoce  prodane_mnozstvi  cena
0       A  jablko                10    20
1       A   banan                15    12
2       B  jablko                 8    22
3       B   banan                30    10
4       C  jablko                20    18
5       C   banan                25    15

In [143]:
ovoce_df.groupby('pobocka').aggregate({'prodane_mnozstvi': "sum"})  # .sum()

         prodane_mnozstvi
pobocka
A                      25
B                      38
C                      45

In [144]:
ovoce_df.groupby('pobocka').aggregate({'prodane_mnozstvi': sum, 'cena': 'mean'})

/tmp/ipykernel_68285/3556529957.py:1: FutureWarning: The provided callable <built-in function sum> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  ovoce_df.groupby('pobocka').aggregate({'prodane_mnozstvi': sum, 'cena': 'mean'})

         prodane_mnozstvi  cena
pobocka
A                      25  16.0
B                      38  16.0
C                      45  16.5

1. Nejprve jsou hodnoty seskupen칤 podle sloupce `pobocka`,
2. pot칠 specifikuje코 pomoc칤 `aggregate` funkce a sloupce,
3. .. tedy sumarizovat hodnoty v `prodane_mnozstvi` a z칤skat pr콢m캩r `cena` pro ka쬯ou pobo캜ku.

### Metoda FILTER

---

Filtrov치n칤 ti umo쬹칤 zahodit takov칠 칰daje, kter칠 nespl켿uj칤 zadanou podm칤nku.

Metoda `filter` se pou쮂셨치 k vybr치n칤 **seskupen칳ch dat** podle spln캩n칤 **ur캜it칠 podm칤nky**.

P콏edstavme si, 쬰 m치me n치sleduj칤c칤 dataset s informacemi o prodeji ovoce v r콢zn칳ch obchodech:

```
pobocka,ovoce,prodane_mnozstvi,cena
A,apple,10,20
A,banana,15,12
B,apple,8,22
B,banana,30,10
C,apple,20,18
C,banana,25,15
```

In [145]:
ovoce_data = {
    'pobocka': ['A', 'A', 'B', 'B', 'C', 'C'],
    'ovoce': ['jablko', 'banan', 'jablko', 'banan', 'jablko', 'banan'],
    'prodane_mnozstvi': [10, 15, 8, 30, 20, 25],
    'cena': [20, 12, 22, 10, 18, 15]
}

In [146]:
ovoce_df = pd.DataFrame(ovoce_data)

In [147]:
ovoce_df

  pobocka   ovoce  prodane_mnozstvi  cena
0       A  jablko                10    20
1       A   banan                15    12
2       B  jablko                 8    22
3       B   banan                30    10
4       C  jablko                20    18
5       C   banan                25    15

In [148]:
def vyber_s_prodejem_nad_limit(data: pd.DataFrame,
                               limit: int = 30) -> bool:
    return data['prodane_mnozstvi'].sum() > limit

<br>

Funkce `vyber_s_prodejem_nad_limit`, tedy **filtrovac칤 funkce**, mus칤 vracet **boolean** datov칳 typ.

In [149]:
ovoce_df.groupby('pobocka').filter(vyber_s_prodejem_nad_limit)

  pobocka   ovoce  prodane_mnozstvi  cena
2       B  jablko                 8    22
3       B   banan                30    10
4       C  jablko                20    18
5       C   banan                25    15

1. Nejprve seskup칤코 data podle sloupce `pobocka` pomoc칤 `groupby`,
2. d치le pou쬴je코 metodu `filter`, kter치 umo쮄갓je pou쮂셦 u쬴vatelem definovanou funkci (`vyber_pouze_pobocky_s_prodejem_nad_limit`),
3. definuje코 funkci, kter치 vybere pouze pobo캜ky s v캩t코칤m prodejem ne je parametr `limit`,
4. metoda `filter` pak vybere pouze ty 콏치dky, kter칠 spl켿uj칤 tuto podm칤nku.

### Metoda TRANSFORM

---

Zat칤mco p콏edchoz칤 v칳sledky *agregace* pomoc칤 `groupby` vraceli redukovan칠 mno쬽tv칤 dat.

Transformace obvykle vrac칤 data o stejn칠m rozsahu jako vstupn칤 data. Jenom upraven치.

Metoda `transform` se pou쮂셨치 k aplikaci ur캜it칠 **transforma캜n칤 funkce** na ka쬯칳 prvek seskupen칳ch dat.

In [150]:
ovoce_df

  pobocka   ovoce  prodane_mnozstvi  cena
0       A  jablko                10    20
1       A   banan                15    12
2       B  jablko                 8    22
3       B   banan                30    10
4       C  jablko                20    18
5       C   banan                25    15

In [152]:
def vrat_procenta_z_celkoveho_prodeje(udaj: pd.Series) -> float:
    return round(udaj / udaj.sum() * 100, 1)

<br>

Vytvo콏en칤 nov칠ho sloupe캜ku `vrat_procenta_z_celkoveho_prodeje`:

In [153]:
ovoce_df['Procento z celkoveho prodeje'] = ovoce_df.groupby('pobocka')['prodane_mnozstvi'] \
    .transform(vrat_procenta_z_celkoveho_prodeje)

In [154]:
ovoce_df

  pobocka   ovoce  prodane_mnozstvi  cena  Procento z celkoveho prodeje
0       A  jablko                10    20                          40.0
1       A   banan                15    12                          60.0
2       B  jablko                 8    22                          21.1
3       B   banan                30    10                          78.9
4       C  jablko                20    18                          44.4
5       C   banan                25    15                          55.6

1. Nejprve seskup칤코 data podle sloupce `pobocka` pomoc칤 `groupby`,
2. d치le pou쬴je코 metodu `transform`, kter치 umo쮄갓je pou쮂셦 u쬴vatelem definovanou funkci,
3. definuje코 funkci, kter치 vybere vypo캜칤t치 procentu치ln칤 vyj치d콏en칤 prodan칠ho zbo쮂 pro pobo캜ku,
4. p콏id치코 nov칳 sloupe캜ek `procento_z_celkoveho_prodeje`.

### Metoda `APPLY`

---

Metoda `apply` ti tak칠 dovol칤, pou쮂셨at u쬴vatelem definovan칠 funkce na seskupen치 data.

N치sledn캩 vrac칤 objekt knihovny `pandas` (bu캞 `DataFrame`, nebo `Series`, a nebo skal치rn칤 hodnota).

In [155]:
ovoce_df

  pobocka   ovoce  prodane_mnozstvi  cena  Procento z celkoveho prodeje
0       A  jablko                10    20                          40.0
1       A   banan                15    12                          60.0
2       B  jablko                 8    22                          21.1
3       B   banan                30    10                          78.9
4       C  jablko                20    18                          44.4
5       C   banan                25    15                          55.6

In [156]:
def vypocitej_vydelek_za_artikl(seskupene: pd.DataFrame):
    seskupene['vydelek_za_artikl'] = seskupene['prodane_mnozstvi'] * seskupene['cena']
    return seskupene

<br>

Metoda `apply` je **obecn캩j코칤 a flexibiln캩j코칤** ne `transform`.

`apply` umo쮄갓je pou쮂셦 u쬴vatelem definovanou funkci na ka쬯ou skupinu po seskupen칤 dat pomoc칤 `groupby`.

V칳sledek metody `apply` m콢쬰 m칤t jin칳 tvar ne p콢vodn칤 data.

In [157]:
ovoce_df.groupby('pobocka', group_keys=False).apply(vypocitej_vydelek_za_artikl)

/tmp/ipykernel_68285/1309931521.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  ovoce_df.groupby('pobocka', group_keys=False).apply(vypocitej_vydelek_za_artikl)

,pobocka,ovoce,prodane_mnozstvi,cena,Procento z celkoveho prodeje,vydelek_za_artikl
0,A,jablko,10,20,40.0,200
1,A,banan,15,12,60.0,180
2,B,jablko,8,22,21.1,176
3,B,banan,30,10,78.9,300
4,C,jablko,20,18,44.4,360
5,C,banan,25,15,55.6,375

In [158]:
# ovoce_df.groupby?

In [219]:
vystup = ovoce_df.groupby('pobocka', group_keys=True).apply(vypocitej_vydelek_za_artikl)
vystup

/tmp/ipykernel_68285/1469620259.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  vystup = ovoce_df.groupby('pobocka', group_keys=True).apply(vypocitej_vydelek_za_artikl)

          pobocka   ovoce  prodane_mnozstvi  cena  vydelek_za_artikl
pobocka
A       0       A  jablko                10    20                200
        1       A   banan                15    12                180
B       2       B  jablko                 8    22                176
        3       B   banan                30    10                300
C       4       C  jablko                20    18                360
        5       C   banan                25    15                375

Na prvn칤 pohled vypadaj칤 metody `apply` a `transform` docela podobn캩.

Metoda `transform` je trochu omezen캩j코칤 ne `apply`.

Slou쮂 k aplikaci u쬴vatelem definovan칠 nebo vestav캩n칠 funkce **na ka쬯칳 prvek** skupiny po seskupen칤 s `groupby`.

`transform` mus칤 vracet hodnotu stejn칠ho tvaru jako vstupn칤 data.

V칳sledek metody `transform` **m치 stejn칳 tvar jako p콢vodn칤 data**.

#### Apply
* pot콏ebuje코 v칳sledek, kter칳 **m치 jin칳 tvar ne p콢vodn칤 data**,
* um칤 zpracovat **v칤ce sloupe캜k콢 sou캜asn캩**.

#### Transform
* pot콏ebuje코 v칳sledek, kter칳 **m치 stejn칳 tvar jako p콢vodn칤 data**,
* um칤 zpracovat **pouze jeden sloupe캜ek**.

In [168]:
df_rozdily = pd.DataFrame({
    'KLIC': ['A','B','C'] * 3,
    'A': np.arange(9),
    'B': [1,2,3] * 3,
})

In [169]:
df_rozdily

  KLIC  A  B
0    A  0  1
1    B  1  2
2    C  2  3
3    A  3  1
4    B  4  2
5    C  5  3
6    A  6  1
7    B  7  2
8    C  8  3

#### `transform` vrac칤 v칳sledky ve stejn칠m tvaru

---

In [170]:
def vypocitej_sumu(data):
    return data.sum()

In [171]:
seskup_df_rozdily_apply = df_rozdily.groupby('KLIC')['A'].apply(vypocitej_sumu)

In [172]:
seskup_df_rozdily_apply

KLIC
A     9
B    12
C    15
Name: A, dtype: int64

In [173]:
seskup_df_rozdily_trans = df_rozdily.groupby('KLIC')['A'].transform(vypocitej_sumu)

In [174]:
seskup_df_rozdily_trans

0     9
1    12
2    15
3     9
4    12
5    15
6     9
7    12
8    15
Name: A, dtype: int64

#### `apply` um칤 pracovat s v칤ce sloupe캜ky, `transform` jen s jedn칤m

---

In [220]:
df_rozdily

  KLIC  A  B
0    A  0  1
1    B  1  2
2    C  2  3
3    A  3  1
4    B  4  2
5    C  5  3
6    A  6  1
7    B  7  2
8    C  8  3

In [221]:
def vypocitej_rozdil(data):
    return data['B'] - data['A']

In [222]:
df_rozdily.groupby('KLIC').apply(vypocitej_rozdil)

/tmp/ipykernel_68285/1031615797.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df_rozdily.groupby('KLIC').apply(vypocitej_rozdil)

KLIC
A     0    1
      3   -2
      6   -5
B     1    1
      4   -2
      7   -5
C     2    1
      5   -2
      8   -5
dtype: int64

In [223]:
df_rozdily.groupby('KLIC').transform(vypocitej_rozdil)

KeyError: 'B'

<br>

**游 CVI캛EN칈 游, procvi캜 si funkc칤 GroupBy a agrega캜n칤 funkce**

M치코 zadan칳 takov칳 datov칳 set.

N치sledn캩:
1. Pomoc칤 metody `filter` vyber prodejny, kter칠 prodaly **alespo켿 30 produkt콢**,
2. na filtrovan칠m datasetu pou쬴jte metodu `apply` pro v칳po캜et **celkov칠ho p콏칤jmu z prodeje pro ka쬯칳 obchod**.

In [179]:
df_prodej_hardware = pd.DataFrame({
    'prodejna_id': (5, 4, 1, 5, 5, 1, 4, 2, 5, 1, 3, 1, 3, 4, 2, 1, 5, 4, 1, 5),
    'transakce_id': (1278, 1216, 1866, 1872, 1797, 1272, 1880, 1061, 1595, 1879, 1728,
       1341, 1396, 1698, 1018, 1176, 1611, 1395, 1444, 1232),
    'predmet_prodeje': ('grafick치_karta', 'SSD', 'RAM', 'procesor', 'grafick치_karta',
       'z치kladn칤_deska', 'SSD', 'SSD', 'grafick치_karta', 'RAM',
       'grafick치_karta', 'procesor', 'grafick치_karta', 'SSD',
       'grafick치_karta', 'RAM', 'z치kladn칤_deska', 'HDD', 'grafick치_karta',
       'RAM'),
    'pocet_prodanych_ks': (1,  5,  6,  6,  3,  7,  9, 10,  8,  6,  8,  5,  8, 10,  4, 10,  8,
       10,  2,  5),
    'cena_predmetu': (19500.69874949, 19731.10951735, 14114.15342339, 10953.87914371,
        6535.78851758, 16369.00288429, 13852.2578648 ,  3671.03031723,
       18263.08009763, 16539.476237  , 19021.09830919, 14651.53041357,
       12461.59632075,  8655.73920767, 18688.2054254 , 17388.24584526,
        1381.76406707,  1014.1560027 ,  7841.03565412, 16305.78995025)
})

<details>
    <summary>郊윒잺 콎e코en칤</summary>
    
```python
def vyber_prodej_vetsi_nez_limit(data, limit: int = 30):
    return data['pocet_prodanych_ks'].sum() > limit
    
def vypocitej_celkovy_vydelek_prodejny(skupina):
    return (skupina['pocet_prodanych_ks'] * skupina['cena_predmetu']).sum()

df_filtr_hardware = df_prodej_hardware.groupby('prodejna_id') \
                        .filter(vyber_prodej_vetsi_nez_limit)

#         cilove_prodejny = df_prodej_hardware.groupby('prodejna_id') \
# .filter(lambda prodejna: prodejna.pocet_prodanych_ks.sum() >= 30)


celkovy_vydelek = df_filtr_hardware.groupby('prodejna_id') \
                        .apply(vypocitej_celkovy_vydelek_prodejny)

# prodeje_prodejen = cilove_prodejny.groupby('prodejna_id') \
# .aggregate({'pocet_prodanych_ks': sum})

# df_prodej_hardware["prodejna_id"].unique()

# prijmy_prodejen = pd.DataFrame(df_prodej_hardware.groupby('prodejna_id')['cena_predmetu'] \
#                 .apply(lambda prodejna: prodejna.sum())) \
#                 .rename(columns = { 'cena_predmetu': 'prijem_z_prodeje' } ) \
#                 .round( 2 )
```
</details>


<img src="https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse2.mm.bing.net%2Fth%3Fid%3DOIP.P16hnt14CM-mJ5eAKykxLAHaHa%26pid%3DApi&f=1&ipt=27e3f5b23fe44567ad0730192d5dcb13c7c23aa6e87579d16df05e27461dc12c&ipo=images" width="160" style="margin-left:auto; margin-right:auto"/>

## Pivot tabulky

---

*Pivot tabulky* (*kontingen캜n칤 tabulky*) jsou u쬴te캜n칠 pro p콏ehledn칠 zobrazen칤 a anal칳zu dat z tabulkov칳ch zdroj콢.

Pomoc칤 pivot tabulek m콢쬰코 **seskupit data podle ur캜it칳ch kategori칤** a prov칠st agregaci hodnot.

Nejprve si p콏edstav situaci bez pivot tabulek, pomoc칤 uk치zky n칤쬰:

In [183]:
!pip install seaborn

Successfully installed contourpy-1.3.1 cycler-0.12.1 fonttools-4.56.0 kiwisolver-1.4.8 matplotlib-3.10.1 pillow-11.1.0 pyparsing-3.2.1 seaborn-0.13.2

[notice] A new release of pip is available: 24.2 -> 25.0.1
[notice] To update, run: pip install --upgrade pip

In [184]:
import seaborn

<br>

V t칠to ukazce pou쬴je코 vzorov치 data t칳kaj칤c칤 se [nehody lodi Titanic](https://en.wikipedia.org/wiki/Sinking_of_the_Titanic):

In [185]:
df_titanic = seaborn.load_dataset('titanic')

In [186]:
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

<br>

Pro jakoukoliv pokro캜ilou anal칳zu dat, pot콏ebuje코 칰daj seskupit.

Tak jak jsi do prov치d캩l doposud, pomoc칤 `groupby`:

In [187]:
df_titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [188]:
df_titanic["sex"].unique()

array(['male', 'female'], dtype=object)

In [189]:
df_titanic.groupby('sex')

<br>

Pot콏ebuje코 pr콢m캩rnou hodnotu, a콘 je na sloupe캜ku `survived` vid캩t pom캩r p콏e쬴v코칤ch:

In [190]:
df_titanic.groupby('sex')['survived'].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

<br>

Pro lep코칤 캜itelnost **zaokrouhl칤m v칳sledek na dv캩 desetinn칠 캜칤sla**:

In [191]:
df_titanic.groupby('sex')['survived'].mean().round(2)

sex
female    0.74
male      0.19
Name: survived, dtype: float64

Takov칳 pr콢zkum z t칠to studie ti d치 jasn칳 pohled na v캩c:
* 3 ze 4 쬰n p콏e쬴ly,
* 1 z 5 mu쮄 p콏e쬴l.

<br>

Pokud bude코 pot콏ebovat detailn캩j코칤 anal칳zy, bude코 pot콏ebovat v칤ce dat.

T콏eba situaci, kde krom캩 pohlav칤, bere코 v potaz **t콏칤du cestuj칤c칤ch** `class`:

In [192]:
df_titanic["class"].unique()

['Third', 'First', 'Second']
Categories (3, object): ['First', 'Second', 'Third']

In [193]:
df_titanic.groupby(['sex', 'class'])[['survived']].mean()

/tmp/ipykernel_68285/926972497.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df_titanic.groupby(['sex', 'class'])[['survived']].mean()

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [194]:
type(df_titanic.groupby(['sex', 'class'])[['survived']])

/tmp/ipykernel_68285/3376760622.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  type(df_titanic.groupby(['sex', 'class'])[['survived']])

pandas.core.groupby.generic.DataFrameGroupBy

In [195]:
type(df_titanic.groupby(['sex', 'class'])['survived'].mean())

/tmp/ipykernel_68285/2747185275.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  type(df_titanic.groupby(['sex', 'class'])['survived'].mean())

pandas.core.series.Series

In [196]:
df_titanic.groupby(['sex', 'class'])[['survived']].mean().round(2)

/tmp/ipykernel_68285/3513781070.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df_titanic.groupby(['sex', 'class'])[['survived']].mean().round(2)

               survived
sex    class
female First       0.97
       Second      0.92
       Third       0.50
male   First       0.37
       Second      0.16
       Third       0.14

<br>

Metodou `unstack` si m콢쬰코 vytvo콏it nov칠 sloupe캜ky, kter칠 jsou postaven칠 na nov칠m Indexu, nebo Indexech (*Multiindex*):

In [197]:
df_titanic.groupby(['sex', 'class'])['survived'].mean().round(2).unstack()

/tmp/ipykernel_68285/800159526.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df_titanic.groupby(['sex', 'class'])['survived'].mean().round(2).unstack()

class   First  Second  Third
sex
female   0.97    0.92   0.50
male     0.37    0.16   0.14

Takov칳 pr콢zkum ti d치 skute캜n캩 lep코칤 pohled na v캩c.

Sou캜asn캩 ale roste **n치ro캜nost ohl치코en칤**.

Z치pis "bobtn치" a **st치v치 se n치ro캜n캩j코칤m na p콏e캜ten칤 a pochopen칤**.

<br>

### Pivot tabulka

---

Podobn칠 콏e코en칤 ti nab칤z칤 funkce `pivot_table`:

In [198]:
df_titanic.groupby(['sex', 'class'])['survived'].mean().round(2).unstack()

/tmp/ipykernel_68285/800159526.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df_titanic.groupby(['sex', 'class'])['survived'].mean().round(2).unstack()

class   First  Second  Third
sex
female   0.97    0.92   0.50
male     0.37    0.16   0.14

In [199]:
df_titanic.pivot_table('survived', index='sex', columns='class').round(2)

/tmp/ipykernel_68285/1120576390.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  df_titanic.pivot_table('survived', index='sex', columns='class').round(2)

class   First  Second  Third
sex
female   0.97    0.92   0.50
male     0.37    0.16   0.14

In [200]:
df_titanic.index

RangeIndex(start=0, stop=891, step=1)

Z치s치dn칤m rozd칤lem je ov코em **캜itelnost**, kterou m치코 pro tuto variantu z치pisu.

```
Clarity beats purity
```

Pomoc칤 vhodn칳ch argument콢, m콢쬰코 doplnit vysv캩tlivky tam, kde funkce `groupby` nemohla.

Stejn캩 plat칤, 쬰 pokud bude코 pot콏ebovat **dal코칤 Index**, m콢쬰코 si pomoci funkc칤 `cut`:

In [201]:
df_titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [202]:
df_titanic['age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: age, dtype: float64

In [224]:
age = pd.cut(df_titanic['age'], [1, 40, 80])

In [225]:
age  # < xxx , xxx )

0      (1.0, 40.0]
1      (1.0, 40.0]
2      (1.0, 40.0]
3      (1.0, 40.0]
4      (1.0, 40.0]
          ...
886    (1.0, 40.0]
887    (1.0, 40.0]
888            NaN
889    (1.0, 40.0]
890    (1.0, 40.0]
Name: age, Length: 891, dtype: category
Categories (2, interval[int64, right]): [(1, 40] < (40, 80]]

In [207]:
vystup_df = df_titanic.pivot_table('survived', index=['sex', age], columns='class').round(2)

/tmp/ipykernel_68285/2750946216.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  vystup_df = df_titanic.pivot_table('survived', index=['sex', age], columns='class').round(2)

In [226]:
vystup_df

class            First  Second  Third
sex    age
female (1, 40]    0.97    0.93   0.47
       (40, 80]   0.96    0.85   0.11
male   (1, 40]    0.50    0.11   0.16
       (40, 80]   0.28    0.10   0.06

In [209]:
vystup_df.index

MultiIndex([('female',  (1, 40]),
            ('female', (40, 80]),
            (  'male',  (1, 40]),
            (  'male', (40, 80])],
           names=['sex', 'age'])

Pomoc칤 funkce `cut` dopln칤코 tabulku na **MultiIndex**.

Ten nyn칤 vytvo콏칤 i rozsah pro v캩kovou kategorii.

In [229]:
data = {
    'M캩s칤c': ['Leden', 'Leden', '칔nor', '칔nor', 'B콏ezen', 'B콏ezen', 'Duben', 'Duben'],
    'Kategorie': ['Elektronika', 'Oble캜en칤', 'Elektronika', 'Oble캜en칤', 
                  'Elektronika', 'Oble캜en칤', 'Elektronika', 'Oble캜en칤'],
    'Tr쬭y': [5000, 3000, 6000, 4000, 5500, 3500, 5800, 3800]
}
df = pd.DataFrame(data)
df

    M캩s칤c    Kategorie  Tr쬭y
0   Leden  Elektronika   5000
1   Leden     Oble캜en칤   3000
2    칔nor  Elektronika   6000
3    칔nor     Oble캜en칤   4000
4  B콏ezen  Elektronika   5500
5  B콏ezen     Oble캜en칤   3500
6   Duben  Elektronika   5800
7   Duben     Oble캜en칤   3800

In [230]:
pivot_df = df.pivot_table(index='M캩s칤c', columns='Kategorie', values='Tr쬭y', aggfunc='sum')
pivot_df

Kategorie  Elektronika  Oble캜en칤
M캩s칤c
B콏ezen            5500      3500
Duben             5800      3800
Leden             5000      3000
칔nor              6000      4000

<br>

**游 CVI캛EN칈 游, procvi캜 si pivot tabulky**

Ze zadan칠ho datasetu vytvo콏 **pivot tabulku**, kter치 zobraz칤 **po캜et prodan칳ch kus콢 ovoce** pro **ka쬯칳 obchod** a **druh ovoce**.

In [240]:
ovoce_data = {
    'pobocka': ['A', 'A', 'B', 'B', 'C', 'C'],
    'ovoce': ['jablko', 'banan', 'jablko', 'banan', 'jablko', 'banan'],
    'prodane_mnozstvi': [10, 15, 8, 30, 20, 25],
    'cena': [20, 12, 22, 10, 18, 15]
}

In [ ]:
# pivot_table()
#              prodane_mnozstvi      jablko banan
# Pobocka
#    A 
#    B
#    C

<details>
    <summary>郊윒잺 콎e코en칤</summary>
    
```python
pivot_tabulka = df_ovoce.pivot_table(values="prodane_mnozstvi", index="pobocka", columns="ovoce")
```
</details>

---